In [2]:
import pandas as pd

In [3]:
file_path = r"E:\AI_HUB\data\Training\labeled_data\TL_csv\tn_companion_info_동반자정보_H.csv"

tn_companion_info = pd.read_csv(file_path)

tn_companion_info

,COMPANION_SEQ,TRAVEL_ID,REL_CD,COMPANION_GENDER,COMPANION_AGE_GRP,COMPANION_SITUATION
0,4,e_e000295,7,1,3,3
1,6,e_e000295,7,1,3,3
2,8,e_e000295,7,1,4,3
3,10,e_e000295,7,2,4,3
4,12,e_e000295,7,2,4,3
...,...,...,...,...,...,...
3946,1,h_h006755,8,1,3,1
3947,1,h_h006766,7,2,6,1
3948,1,h_h006870,2,1,2,1
3949,1,h_h006872,1,1,4,1
3950,2,h_h006872,2,1,1,1

In [8]:
tn_companion_info = tn_companion_info.drop(tn_companion_info[['COMPANION_GENDER', 'COMPANION_AGE_GRP', 'COMPANION_SITUATION']], axis=1)

In [10]:
tn_companion_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3951 entries, 0 to 3950
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   COMPANION_SEQ  3951 non-null   int64
 1   TRAVEL_ID      3951 non-null   object
 2   REL_CD         3951 non-null   int64
dtypes: int64(2), object(1)
memory usage: 92.7+ KB

In [5]:
rel_cd_counts = tn_companion_info["REL_CD"].value_counts()
print(rel_cd_counts) # 자녀, 친구, 배우자, 연인, 부모 순

REL_CD
2     895
7     825
1     703
8     594
3     389
5     204
6     122
9      76
11     63
10     58
4      22
Name: count, dtype: int64

In [ ]:
tn_companion_info = tn_companion_info.drop([tn_companion_info['']]